practice-for-ch-rails-reddit-long-practice-main/RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-08-11 20:34:06.246501"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = SecureRandom::safeurl_base64
        self.save!